back-end/app/controllers/auth_controller.rb

    def login
        user = User.find_by(user_name: params[:user_name], password_digest: params[:password_digest])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = $1 AND "users"."password_digest" = $2 LIMIT $3  [["user_name", "new"], ["password_digest", "1234"], ["LIMIT", 1]]