back-end/app/controllers/flights_controller.rb

INSERT INTO "flights" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-01-22 19:28:24.238770"], ["updated_at", "2020-01-22 19:28:24.238770"]]
---
    def create
        @flight = Flight.create(filtered_params)