back-end/app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
    def new
        @flight =Flight.find_by_id(params[:id])

SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @flight = Flight.find_by_id(params[:id])

SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "flights" SET "status" = $1, "updated_at" = $2 WHERE "flights"."id" = $3  [["status", "teeeeeeeest"], ["updated_at", "2020-01-29 04:56:25.718853"], ["id", 2]]
---
    def update
        @flight = Flight.find_by_id(params[:id])
        @flight.update(status: params[:status])

INSERT INTO "flights" ("user_id", "airline", "arrival", "departure", "flightt", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @flight = Flight.create(filtered_params)

SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 13]]
---
    def destroy
        @flight = Flight.find_by_id(params[:id])
        @flight.destroy