back-end/app/controllers/users_controller.rb

    def show
        user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @user = User.create(filtered_params)
---
INSERT INTO "users" ("user_name", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_name", "sos"], ["first_name", "dhsfjshfj"], ["last_name", "shdjh"], ["password_digest", "1234"], ["created_at", "2020-01-30 21:10:48.357600"], ["updated_at", "2020-01-30 21:10:48.357600"]]